Revit 2024 API
PanelScheduleData.IsSymmetric Method
 Check if this panel schedule is symmetric
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsSymmetric()
Visual Basic
Public Function IsSymmetric As Boolean
Visual C++
public:
bool IsSymmetric()
Return Value
 True if this panel schedule is symmetric, false otherwise.
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace